dotnet/middleware.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>middleware</title>
<!-- 2019-02-05 Tue 08:26 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />


</head>
<body>
<div id="content">
<h1 class="title">middleware</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. NET Core Middleware.</a>
<ul>
<li><a href="#sec-1-1">1.1. Defining a custom .UseMyMiddleware extension method</a></li>
<li><a href="#sec-1-2">1.2. Extras</a></li>
<li><a href="#sec-1-3">1.3. Authentication Middleware</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> NET Core Middleware.</h2>
<div class="outline-text-2" id="text-1">
<p>
Notes derived from: [<a href="https://www.blinkingcaret.com/2017/09/13/create-your-own-asp-net-core-middleware/][this">https://www.blinkingcaret.com/2017/09/13/create-your-own-asp-net-core-middleware/][this</a> is it]
</p>

<p>
Pipeline gets configured in the `Startup.cs` file, in the `Configure` method.
</p>

<div class="org-src-container">

<pre class="src src-python">public void Configure(IApplicationBuilder app, IHostingEnvironment env, ILoggerFactory, IdentityDbContext dbContext)
{
  app.UseDeveloperExceptionPage();
  app.UseStaticFilex();
  app.UseMvcWithDefaultRoute();
}
</pre>
</div>

<p>
These run in the order defined.  The `UseDeveloperExceptionPage` handles exceptions raised in the middleware below it.
</p>

<p>
There is also an extension method in `IApplicationBuilder` that lets us write our middleware inline in the `Config` method.
</p>

<div class="org-src-container">

<pre class="src src-javascript">public void Configure(IApplicationBuilder app, IHostingEnvironment env, ILoggerFactory, IdentityDbContext dbContext)
{
  app.Use(async (HttpContext context, Func&lt;Task&gt; next) =&gt;
  {
    // 1. do work before invoking the rest of the pipeline.
    await next.Invoke(); // 2. let the rest of the pipeline run.
    // 3. do work after the rest of the pipeline has run.
  }
}
</pre>
</div>

<p>
The middleware requires a method with a specific signature. It requires a constructor with atleast one parameter type of `RequestDelegate`.  A request delegate is just the definition of a function signature:
</p>

<p>
`public delegate Task RequestDelegate(HttpContext context);`
</p>

<p>
It requires a constructor with atleast one parameter of type `RequestDelegate` (above).
It receives an `HttpContext` and returns a `Task`.
</p>

<p>
This is what executes in the pipeline.
</p>

<p>
You can pass options to the middleware, this can be done in the constructor as a second parameter of type `IOptions&lt;YourOptionsType&gt;`.  
</p>

<p>
Eg.
</p>
<div class="org-src-container">

<pre class="src src-csharp">public class MyFileLoggerMiddleware
{
  private readonly RequestDelegate _next;
  private readonly MyFileLoggerOptions _options;

  public MyFileLoggerMiddleware(RequestDelegate next, IOptions&lt;MyFileLogger&gt; options)
  { 
    _next = next;
    _options = options;
  }
}
</pre>
</div>

<p>
Next comes the method that gets called when the middleware is executed:
</p>
<div class="org-src-container">

<pre class="src src-csharp">public asyan Task Invoke(HttpContext context){
  var request = context.Request;
  var message = context.Method;
  var path = request.Path.Value;
  var query = request.QueryString;
  var requestLogMessage = request.Host;

  File.AppendAllText(_options.FileName, $"{DateTime.Now.ToString("s")}\{message}");

  await _next(context);

  var response = context.Response;
  var responseLogMessage = $"\nRESPONSE:\nStatus Code: {response.StatusCode}";
	File.AppendAllText(_options.FileName, $"{responseLogMessage}\n\n");
}
</pre>
</div>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Defining a custom .UseMyMiddleware extension method</h3>
<div class="outline-text-3" id="text-1-1">
<p>
If you want to stop here you can already use the middleware, just go to your Configure method in Startup.cs and add the middleware to the pipeline by doing this:
</p>

<pre class="example">
app.UseMiddleware&lt;MyFileLoggerMiddleware&gt;(Options.Create(new MyFileLoggerOptions{
    FileName = Path.Combine(env.ContentRootPath, "logFile.txt") 
}));
</pre>

<p>
The only thing to be aware here is that you have to use Options.Create and pass in an instance of the options class.
</p>

<p>
However to be able to just do app.UseMyFileLogger we need to create an extension method targeting IApplicationBuilder, here’s how we can do that:
</p>


<pre class="example">
public static class MyFileLoggerMiddlewareExtensions
{
    public static IApplicationBuilder UseMyFileLogger(this IApplicationBuilder app, MyFileLoggerOptions options)
    {
        return app.UseMiddleware&lt;MyFileLoggerMiddleware&gt;(Options.Create(options));
    }
}
</pre>

<p>
To use it in the Configure method in Startup.cs you can now simply do:
</p>

<pre class="example">
 app.UseMyFileLogger(new MyFileLoggerOptions {
    FileName = Path.Combine(env.ContentRootPath, "log.txt") 
});
</pre>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Extras</h3>
<div class="outline-text-3" id="text-1-2">
<p>
All middleware has access to an instance of `HttpContext`.  It is via here that they can send messages to each other.
</p>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Authentication Middleware</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Inherits from `AuthenticationMiddleware`.  This creates an `AuthenticationHandler`.  In this handler is where most of the functionality lies.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2019-02-05 Tue 08:26</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.1.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
